; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph2 - mode
	spectrograph0 - mode
	spectrograph1 - mode
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	Star0 - direction
	GroundStation5 - direction
	Star4 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon13)
)
(:goal (and
	(have_image Phenomenon6 spectrograph2)
	(have_image Star7 spectrograph2)
	(have_image Planet8 spectrograph1)
	(have_image Star9 spectrograph1)
	(have_image Phenomenon10 spectrograph0)
	(have_image Phenomenon11 spectrograph0)
	(have_image Star12 spectrograph2)
	(have_image Phenomenon13 spectrograph0)
	(have_image Star14 spectrograph1)
	(have_image Planet15 spectrograph0)
))

)

; plan
1. (turn_to satellite0 star0 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star0)
   goals met: 0 of 10
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 10
3. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 10
4. (turn_to satellite0 phenomenon13 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon13)
   goals met: 0 of 10
5. (take_image satellite0 phenomenon13 instrument0 spectrograph0)
   added: (have_image phenomenon13 spectrograph0)
   goals met: 1 of 10
6. (turn_to satellite0 phenomenon11 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon11)
   goals met: 1 of 10
7. (take_image satellite0 phenomenon11 instrument0 spectrograph0)
   added: (have_image phenomenon11 spectrograph0)
   goals met: 2 of 10
8. (turn_to satellite0 phenomenon10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 10
9. (take_image satellite0 phenomenon10 instrument0 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 3 of 10
10. (turn_to satellite0 phenomenon6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon6)
   goals met: 3 of 10
11. (take_image satellite0 phenomenon6 instrument0 spectrograph2)
   added: (have_image phenomenon6 spectrograph2)
   goals met: 4 of 10
12. (turn_to satellite0 planet15 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet15)
   goals met: 4 of 10
13. (take_image satellite0 planet15 instrument0 spectrograph0)
   added: (have_image planet15 spectrograph0)
   goals met: 5 of 10
14. (turn_to satellite0 planet8 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet8)
   goals met: 5 of 10
15. (take_image satellite0 planet8 instrument0 spectrograph1)
   added: (have_image planet8 spectrograph1)
   goals met: 6 of 10
16. (turn_to satellite0 star12 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star12)
   goals met: 6 of 10
17. (take_image satellite0 star12 instrument0 spectrograph2)
   added: (have_image star12 spectrograph2)
   goals met: 7 of 10
18. (turn_to satellite0 star14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star14)
   goals met: 7 of 10
19. (take_image satellite0 star14 instrument0 spectrograph1)
   added: (have_image star14 spectrograph1)
   goals met: 8 of 10
20. (turn_to satellite0 star7 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star7)
   goals met: 8 of 10
21. (take_image satellite0 star7 instrument0 spectrograph2)
   added: (have_image star7 spectrograph2)
   goals met: 9 of 10
22. (turn_to satellite0 star9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star9)
   goals met: 9 of 10
23. (take_image satellite0 star9 instrument0 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 10 of 10
